README.org
# This is a file written in Emacs and authored using org-mode (http://orgmode.org/)
# The "README.md" file is generated from this file by running the
# "M-x org-md-export-to-markdown" command from inside of Emacs.
#
# The "cleaner.py" file is generated from this file by running the
# "M-x org-babel-tangle" command from inside of Emacs.
#
# Don't render section numbers
#+OPTIONS: num:nil
# Turn of subscript parsing: http://super-user.org/wordpress/2012/02/02/how-to-get-rid-of-subscript-annoyance-in-org-mode/comment-page-1/
#+OPTIONS: ^:{}
* Okta and AWS in the Browser
  This guide is designed to walk readers through the following:
  - Integrating an AWS-backed JavaScript web application with Okta.
  - Setting up properly scoped permissions for federated access to AWS APIs.
  - Basic usage of the AWS SDK for JavaScript.

  The sample application below authenticates users using [[http://docs.aws.amazon.com/STS/latest/UsingSTS/web-identity-federation.html][web identity
  federation]] and Okta. This guide is based on the AWS
  [[https://aws.amazon.com/developers/getting-started/browser/][JavaScript in the Browser]] guide.

  After logging in, the user will get temporary AWS credentials and
  assume the pre-specified [[http://docs.aws.amazon.com/IAM/latest/UserGuide/roles-toplevel.html][IAM (AWS Identity and Access Management)]]
  role whose policy allows uploading and listing objects in [[http://aws.amazon.com/s3/][Amazon S3]].

  #+BEGIN_QUOTE
  **Note**! These instructions require that your Okta Org is part of the
  *OpenID Connect Beta*. If you do not have the ability to create
  OpenID Connect apps in your Okta org, please contact Okta Support
  and ask that the =OPENID_CONNECT= flag be enabled for your Okta org.
  #+END_QUOTE
* Setting up Okta
** Create an Okta OIDC App and get the Client ID for that app
   You will need an OpenID Connect app in Okta for this sample
   application. You can create an OpenID Connect app as follows:

   1. Log in to your Okta org
   2. After logging in, click on the "Admin" button on the upper right
      of the screen.
   3. Select "Add Applications" from the "Shortcuts" section on the
      right side of the screen.
   4. Click the "Create New App" button on the left side of the
      screen.
   5. Set the "Platform" to: "Single Page App (SPA)", click the
      "Create" button.
   6. Name the application (e.g. =AWS Example=), click the "Next" button.
   7. Click "Add URI" and add the =http://localhost:8000/sample.html=
      URI, then click the "Finish" button.
   8. Click on the "People" section, click "Assign to People", click
      the "Assign" button next to your username, click "Save and Go
      Back", click "Done".

      #+BEGIN_QUOTE
      *Important:* Only users assigned to this
      app will be able to authenticate!
      #+END_QUOTE
   9. Click on the "General" section, scroll down and make note of the
      "*Client ID*", you will use this when you configure AWS.
** Set up CORS in Okta
   This sample application also requires that you [[http://developer.okta.com/docs/api/getting_started/enabling_cors.html][enable CORS]] in Okta.

   1. From the "Security" menu in the Admin interface, select the
      "API" option.
   2. Click on the "CORS" tab in the API screen.
   3. Click the "Edit" button, make sure the "Enable CORS ..." option
      is selected, enter =http://localhost:8000= into the text field,
      then click the "Save" button.
* Setting up AWS
** Create an Amazon S3 bucket and configure CORS
   [[http://en.wikipedia.org/wiki/Cross-origin_resource_sharing][CORS]] needs to be configured on the Amazon S3 bucket to be accessed
   directly from JavaScript in the browser.

   1. Navigate to the [[https://console.aws.amazon.com/s3/home][Amazon S3 console]].
   2. Choose an existing bucket or create a new bucket if
      desired. Note the bucket name and bucket region for later use in
      the application.
   3. Click the *Properties* tab, open the *Permissions* section, and
      click *Edit CORS Configuration*.
   4. Copy the below XML into the text box and click *Save*.
      #+BEGIN_SRC xml
        <?xml version="1.0" encoding="UTF-8"?>
        <CORSConfiguration xmlns="http://s3.amazonaws.com/doc/2006-03-01">
           <CORSRule>
              <AllowedOrigin>*</AllowedOrigin>
              <AllowedMethod>GET</AllowedMethod>
              <AllowedMethod>PUT</AllowedMethod>
              <AllowedMethod>POST</AllowedMethod>
              <AllowedMethod>DELETE</AllowedMethod>
              <AllowedHeader>*</AllowedHeader>
           </CORSRule>
        </CORSConfiguration>
      #+END_SRC

** Create an IAM OpenID Connect Provider
   1. Go to the *Identity Providers* section of the [[https://console.aws.amazon.com/iam/home#policies][IAM console]] and
      click the "Create Provider" button, select "OpenID Connect",
      enter your Okta org URL as the *Provider URL*
      (e.g. =https://example.okta.com=), enter your Okta app /Client ID/ as the
      *Audience*, click "Next Step"
   2. Click "Create" to skip the "Verify Provider Information" instructions.
      /This step is for OIDC providers that sign their OIDC tokens/
      /using the private key from their HTTPS/TLS certificate. Okta/
      /signs OIDC tokens using different keys/
** Create an IAM Role and Assign Users Logged in through Okta
   1. Go to the *Policies* section of the [[https://console.aws.amazon.com/iam/home#policies][IAM console]] and click
      *Create Policy → Create Your Own Policy*.
   2. Name your policy (e.g. =OktaSample=), copy the JSON policy
      below to the *Policy Document* text box, and replace the two
      instances of =YOUR_BUCKET_NAME= with your actual bucket name, and
      click *Create Policy*.
   3. Now go to the *Roles* section of the IAM console and click
      *Create New Role*
   4. Name your role (e.g. =OktaSampleRole=) and select
      *Role for Identity Provider Access → Grant access to web identity providers.*
   5. Select your Okta org from the *Identity Provider* dropdown and
      click "Next Step"
   6. Click "Next Step" on Verify Role Trust.
   7. On the *Attach Policy* step, select the policy you just created
      (e.g. =OktaSample=), and click *Next Step*, then *Create Role*
      on the next page.
   8. Use the JSON below as your for your role.

      #+BEGIN_QUOTE
      *Important:* Make sure that you replace =YOUR_BUCKET_NAME= and
      =YOUR_OIDC_PROVIDER_URL= in the policy!
      #+END_QUOTE

      #+BEGIN_SRC javascript
        {
            "Version": "2012-10-17",
            "Statement": [
                {
                    "Action": [
                        "s3:PutObject",
                        "s3:PutObjectAcl"
                    ],
                    "Resource": [
                        "arn:aws:s3:::YOUR_BUCKET_NAME/okta-${YOUR_OIDC_PROVIDER_URL:sub}/*"
                    ],
                    "Effect": "Allow"
                },
                {
                    "Action": [
                        "s3:ListBucket"
                    ],
                    "Resource": [
                        "arn:aws:s3:::YOUR_BUCKET_NAME"
                    ],
                    "Effect": "Allow",
                    "Condition": {
                        "StringEquals": {
                            "s3:prefix": "okta-${YOUR_OIDC_PROVIDER_URL:sub}"
                        }
                    }
                }
            ]
        }
      #+END_SRC

      #+BEGIN_QUOTE
      *Important:* Make sure you include =:sub= after the end of your
       OIDC provider URL. For example =example.okta.com:sub= or
       =example.oktapreview.com:sub=
      #+END_QUOTE

      If you are wondering, this policy uses [[http://docs.aws.amazon.com/IAM/latest/UserGuide/reference_policies_variables.html][IAM Policy Variables]] to
      restrict =ListBucket= calls to only the files that a user has
      uploaded.

* Running the sample
