README.org
** Create =sample.html=
   Before you can run the example, you need to create a file named
   "=sample.html=" containing the code below. If you name this file
   something other than =sample.html=, you'll have to go back and
   update the settings for your OIDC app.

   Replace the variables in =sample.html= with the approprate
   variables for your system. The variables that you will need to
   replace are below:

   - =YOUR_OIDC_PROVIDER_URL=
     i.e. /example.okta.com/
   - =YOUR_AWS_ROLE_ARN=
     i.e. /arn:aws:iam::123456789012:role/OktaSampleRole/
   - =YOUR_AWS_REGION=
     i.e. /us-east-1/
   - =YOUR_S3_BUCKET_NAME=
     i.e. /example-s3-bucket/
   - =YOUR_OKTA_ORG_URL=
     i.e. /https://example.okta.com/
   - =YOUR_OKTA_APP_CLIENT_ID=
     i.e. /aBCdEf0GhiJkLMno1pq2/

  #+BEGIN_QUOTE
  The ARN (Amazon Resource Name) of your IAM role can be found in
  the [[https://console.aws.amazon.com/iam/home?#roles][IAM console]] by selecting your role and opening the *Summary*
  tab.
  #+END_QUOTE

  The code for =sample.html= is code below.

  Make sure to replace the variables mentioned above!

  #+BEGIN_SRC html :tangle sample.html :noweb yes :export yes
  <<sample-html>>
  #+END_SRC
** Run the sample

   Start a webserver on your server on port 8000 and visit
   http://localhost:8000/sample.html

   If you are on Mac OS X or Linux, you can use Python to
   start a webserver for you: =cd= to the directory where
   =sample.html= is located, then run this command:

   #+BEGIN_EXAMPLE
   [okta-oidc-aws]$ python -m SimpleHTTPServer 8000
   #+END_EXAMPLE
** About the sample
   This sample application is designed to show you how to:
   - Use AWS Web Identity Federation and Okta to authenticate
     users.
   - Assign user-specific write permissions at the prefix level with
     IAM role policy so that users can't overwrite or change other
     users' objects.
   - Instantiate an [[https://aws.amazon.com/s3/][Amazon Simple Storage Service (Amazon S3)]] client.
   - Use ~<input type="file" />~ tag that calls the browser's native
     file interface, and upload the chosen file to an Amazon S3
     bucket, with 'public-read' permissions.
** Additional resources
   For in-depth user guides, API documentation, developer forums, and
   other developer resources, see the [[https://aws.amazon.com/sdk-for-browser/][AWS SDK for JavaScript in the
   Browser]] page.

   For more details on the Okta Sign-In Widget, see the
   [[http://developer.okta.com/code/javascript/okta_sign-in_widget.html][Okta Sign-In Widget Overview]] or the
   [[http://developer.okta.com/code/javascript/okta_sign-in_widget_ref][Okta Sign-In Widget reference]].

* Code
  This section describes the code used in this sample
  application. You only need to read this if you want to learn more
  about how the sample application works.

  This sample consists of two logical components:

  1. The HTML for a sample Single Page Application
  2. The JavaScript that powers this sample Single Page Application

** sample.html

   The HTML for this sample is below. By default we show the Okta
   Sign-In Widget and hide the =upload-dialog= =<div>= with the
   buttons for uploading files to S3.

   After a successful login, we will hide the Okta Sign-In Widget and
   show the =upload-dialog= =<div>=.

   The JavaScript that powers this sample is covered in the next section.

   #+NAME: sample-html
   #+BEGIN_SRC html :noweb no :export yes
     <!DOCTYPE html>
     <html>
       <head>
         <title>AWS and Okta - Sample Application</title>
         <script src="//sdk.amazonaws.com/js/aws-sdk-2.3.7.js"></script>
         <script src="/js/okta-sign-in.min.js" type="text/javascript"></script>
         <link href="/css/okta-sign-in.min.css" type="text/css" rel="stylesheet">
         <link href="/css/okta-theme.css" type="text/css" rel="stylesheet">
       </head>
       <body>
         <div id="okta-login-container"></div>
         <div id="upload-dialog" style="display:none">
           <input type="file" id="file-chooser" />
           <button id="upload-button" style="display:block">Upload to S3</button>
         </div>
         <div id="results"></div>
         <script type="text/javascript">
           <<sample-javascript>>
         </script>
       </body>
     </html>
   #+END_SRC
