README.md


<a id="orgcf7a7d6"></a>

## Create `sample.html`

Before you can run the example, you need to create a file named "`sample.html`" containing the code below. If you name this file something other than `sample.html`, you'll have to go back and update the settings for your OIDC app.

Replace the variables in `sample.html` with the approprate variables for your system. The variables that you will need to replace are below:

-   `YOUR_OIDC_PROVIDER_URL` i.e. *example.okta.com*
-   `YOUR_AWS_ROLE_ARN` i.e. *arn:aws:iam::123456789012:role/OktaSampleRole*
-   `YOUR_AWS_REGION` i.e. *us-east-1*
-   `YOUR_S3_BUCKET_NAME` i.e. *example-s3-bucket*
-   `YOUR_OKTA_ORG_URL` i.e. *<https://example.okta.com>*
-   `YOUR_OKTA_APP_CLIENT_ID` i.e. *aBCdEf0GhiJkLMno1pq2*

> The ARN (Amazon Resource Name) of your IAM role can be found in the [IAM console](https://console.aws.amazon.com/iam/home?#roles) by selecting your role and opening the **Summary** tab.

The code for `sample.html` is code below.

Make sure to replace the variables mentioned above!

```html
<!DOCTYPE html>
<html>
  <head>
    <title>AWS and Okta - Sample Application</title>
    <script src="//sdk.amazonaws.com/js/aws-sdk-2.3.7.js"></script>
    <script src="/js/okta-sign-in.min.js" type="text/javascript"></script>
    <link href="/css/okta-sign-in.min.css" type="text/css" rel="stylesheet">
    <link href="/css/okta-theme.css" type="text/css" rel="stylesheet">
  </head>
  <body>
    <div id="okta-login-container"></div>
    <div id="upload-dialog" style="display:none">
      <input type="file" id="file-chooser" />
      <button id="upload-button" style="display:block">Upload to S3</button>
    </div>
    <div id="results"></div>
    <script type="text/javascript">
